       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB007.
      ******************************************************************
      *AUTHOR: CARLOS AMARAL
      *DATE: 08/28/2021
      *PURPOSE: UTILIZE COMPUTE TO CALCULATE STUDENT AVERAGE
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77 WRK-G1 PIC 99V99 VALUE ZEROES.
       77 WRK-G2 PIC 99V99 VALUE ZEROES.
       77 WRK-G3 PIC 99V99 VALUE ZEROES.
       77 WRK-G4 PIC 99V99 VALUE ZEROES.

       77 WRK-AVERAGE PIC 99V99 VALUE ZEROES.


       PROCEDURE DIVISION.

           ACCEPT WRK-G1 FROM CONSOLE.
           ACCEPT WRK-G2 FROM CONSOLE.
           ACCEPT WRK-G3 FROM CONSOLE.
           ACCEPT WRK-G4 FROM CONSOLE.

           COMPUTE WRK-AVERAGE = (WRK-G1 + WRK-G2 + WRK-G3 + WRK-G4) /4.

           DISPLAY 'STUDENT FINAL GRADE: ' WRK-AVERAGE.

           STOP RUN.
       END PROGRAM PROGCOB007.
