       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB016.
      ******************************************************************
      *AUTHOR: CARLOS AMARAL
      *DATE: 08/29/2021
      *PURPOSE: DÁ AUMENTO DE SALÁRIO DE ACORDO COM O TEMPO DE CASA
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-FUNCIONARIO     PIC X(40)       VALUE SPACES.
       77  WRK-ANODEADMISSAO   PIC 9(4)        VALUE ZEROES.
       77  WRK-ANOSDECASA      PIC 9(2)        VALUE ZEROES.
       77  WRK-SALARIO         PIC 9(4)V99     VALUE ZEROES.
       77  WRK-AUMENTO         PIC 9(4)V99     VALUE ZEROES.
       77  WRK-NOVOSALARIO     PIC 9(5)V99     VALUE ZEROES.
       77  WRK-NOVOSALARIO-ED  PIC $ZZZZ9,99   VALUE ZEROES.
       PROCEDURE DIVISION.

           DISPLAY 'FUNCIONARIO:'
           ACCEPT WRK-FUNCIONARIO.

           DISPLAY 'ANO DE ADMISSAO: '
           ACCEPT WRK-ANODEADMISSAO.

           DISPLAY 'SALARIO: '
           ACCEPT WRK-SALARIO.

           COMPUTE WRK-ANOSDECASA = 2021 - WRK-ANODEADMISSAO.

           EVALUATE WRK-ANOSDECASA
               WHEN 0 THRU 1
                   DISPLAY 'SEU PERCENTUAL DE AUMENTO AINDA E DE 0%'
               WHEN 2 THRU 5
                   DISPLAY 'SEU PERCENTUAL DE AUMENTO E DE 5%'
                   COMPUTE WRK-AUMENTO = WRK-SALARIO * 0,05
               WHEN 6 THRU 15
                   DISPLAY 'SEU PERCENTUAL DE AUMENTO E DE 10%'
                   COMPUTE WRK-AUMENTO = WRK-SALARIO * 0,10
               WHEN OTHER
                   DISPLAY 'SEU PERCENTUAL DE AUMENTO E DE 15%'
                   COMPUTE WRK-AUMENTO = WRK-SALARIO * 0,15
           END-EVALUATE.

           DISPLAY 'TEMPO DE CASA: ' WRK-ANOSDECASA ' ANO(S)'
           COMPUTE WRK-NOVOSALARIO = WRK-SALARIO + WRK-AUMENTO.
           MOVE WRK-NOVOSALARIO TO WRK-NOVOSALARIO-ED.
           DISPLAY 'SALARIO COM AUMENTO: ' WRK-NOVOSALARIO-ED.

           STOP RUN.
       END PROGRAM PROGCOB016.
