       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB001.
      ******************************************************************
      * Author: Carlos Amaral
      * Date: 08/25/2021
      * Purpose: HELLO WORLD
      * Tectonics: cobc
      ******************************************************************
       ENVIRONMENT DIVISION.
       data DIVISION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM PROGCOB001.
